MESSAGE = {'start': 'It is the bot for learning word by mind cards.\nPress button for start of look /help for more',
           'no cards': '✔ You have repeated all the words!\n💰 You can help the bot grow here:',
           'create': 'For create new card write the first word and the second on the next line',
           'translate': 'Write a word for translate to russian by Google translate',
           'delete': 'Do you want to delete the Card?',
           'default': 'Choose what you need:',
           'help': 'Create - вы создание карточку, чтобы запомнить слово. '
                   'С одной стороны слово, с другой - его значение\n'
                   'Translate - помощник Create. Вы пишите слово, бот присылает в ответ шаблон для создания '
                   'карточки с переводом от Google translate\n'
                   'Repeat - бот берёт все карточки, которые нужно повторить сегодня, '
                   'и выдаёт их стопкой в 20 штук, где каждую карточку нужно повторить '
                   'три раза с одной стороны и три раза с другой. Когда слово повторили, '
                   'бот убирает карточку из стопки и добавляет новую из сегодняшних карточек. '
                   'Интервал повторения карточек увеличивается от одного дня в два раза при каждом '
                   'удачном повторении. Кнопка с галочкой значит, что вы вспомнили значение карточки, '
                   'кнопка со знаком вопроса - что не можете вспомнить (в этом случае вы смотрите значение '
                   'под спойлером и придумываете ассоциации, чтобы лучше запомнить). Так же можно удалить карточку, '
                   'если она вам больше не нужна, кнопкой с крестиком, и прослушать, как звучит слово голосом Google '
                   'translate.'
           }
FLAGS = {
    'ru': '🇷🇺',
    'uk': '🇺🇦',
    'en': '🇬🇧',
    'fr': '🇫🇷',
    'es': '🇪🇸',
    'it': '🇮🇹',
    'de': '🇩🇪',
    'zh': '🇨🇳',
    'ja': '🇯🇵',
    'ko': '🇰🇷',
}
